[
  {
    "date": "01-01",
    "name": "Global Family Day",
    "description": "A day dedicated to unity, peace, and sharing between people around the world. It encourages families to spend time together and consider extended humanity as one global family.",
    "funFact": "This holiday was partially inspired by World Peace Day and was recognized by the United Nations in 1999.",
    "media": "global-family-day.jpg",
    "tags": ["global", "peace", "family"]
  },
  {
    "date": "01-16",
    "name": "National Nothing Day",
    "description": "A day to celebrate... absolutely nothing! It's a day where you're not obligated to observe or celebrate anything - essentially, a holiday from holidays.",
    "funFact": "It was created in 1973 by newspaper columnist Harold Pullman Coffin to provide Americans with one day when they could just sit without celebrating, observing, or honoring anything.",
    "media": "nothing-day.jpg",
    "tags": ["quirky", "relaxation"]
  },
  {
    "date": "02-03",
    "name": "International Eat Ice Cream for Breakfast Day",
    "description": "A day dedicated to the simple joy of eating ice cream for breakfast. Started as a way to brighten dark winter days.",
    "funFact": "This holiday was created in the 1960s by a mother in Rochester, NY to entertain her children during a blizzard.",
    "media": "ice-cream-breakfast.jpg",
    "tags": ["food", "fun", "quirky"]
  },
  {
    "date": "03-14",
    "name": "Pi Day",
    "description": "A celebration of the mathematical constant π (3.14). Math enthusiasts around the world celebrate by eating pie, discussing math, and engaging in pi-related activities.",
    "funFact": "The world record for memorizing digits of pi is held by Rajveer Meena, who recited 70,000 digits over nearly 10 hours.",
    "media": "pi-day.jpg",
    "tags": ["science", "mathematics", "education"]
  },
  {
    "date": "04-25",
    "name": "World Penguin Day",
    "description": "A day to appreciate penguins and raise awareness about their conservation. It coincides with the annual northward migration of Adelie penguins in Antarctica.",
    "funFact": "Emperor penguins can dive deeper than any other bird – up to 1,850 feet deep – and can stay underwater for up to 20 minutes.",
    "media": "penguin-day.jpg",
    "tags": ["animals", "conservation"]
  },
  {
    "date": "05-04",
    "name": "Star Wars Day",
    "description": "A celebration of the Star Wars franchise and its cultural impact. The date was chosen for the pun 'May the Fourth be with you,' a play on the famous phrase 'May the Force be with you.'",
    "funFact": "The first organized Star Wars Day was in 2011, but the phrase was first used on May 4, 1979, when Margaret Thatcher was elected as UK Prime Minister and her party placed an ad saying, 'May the Fourth Be with You, Maggie.'",
    "media": "star-wars-day.jpg",
    "tags": ["movies", "pop culture", "sci-fi"]
  },
  {
    "date": "06-17",
    "name": "Eat Your Vegetables Day",
    "description": "A day dedicated to promoting the consumption of vegetables and their health benefits. It encourages people to try new vegetables and incorporate more into their diet.",
    "funFact": "The most consumed vegetable in the United States is the potato, followed by tomatoes (which are botanically fruits but considered vegetables in culinary contexts).",
    "media": "vegetables-day.jpg",
    "tags": ["food", "health"]
  },
  {
    "date": "07-17",
    "name": "World Emoji Day",
    "description": "A global celebration of emojis and their impact on digital communication. July 17 was chosen because it's the date displayed on the calendar emoji on most platforms.",
    "funFact": "The first emoji was created in 1999 by Japanese artist Shigetaka Kurita, who designed 176 original 12x12 pixel emoji for NTT DOCOMO's mobile internet platform.",
    "media": "emoji-day.jpg",
    "tags": ["digital", "communication", "technology"]
  },
  {
    "date": "08-08",
    "name": "International Cat Day",
    "description": "A day to celebrate and raise awareness about cats and their unique needs. It's a perfect day for cat lovers to show extra appreciation for their feline friends.",
    "funFact": "Cats spend about 70% of their lives sleeping and can make over 100 different vocal sounds, while dogs can only make around 10.",
    "media": "cat-day.jpg",
    "tags": ["animals", "pets"]
  },
  {
    "date": "09-19",
    "name": "International Talk Like a Pirate Day",
    "description": "A parodic holiday created in 1995 where people are encouraged to talk like stereotypical pirates ('Arrr, matey!') for fun.",
    "funFact": "This holiday went viral in 2002 when humorist Dave Barry wrote about it in his nationally syndicated column, bringing it to mainstream attention.",
    "media": "pirate-talk-day.jpg",
    "tags": ["humor", "language", "quirky"]
  },
  {
    "date": "10-10",
    "name": "World Mental Health Day",
    "description": "A day for global mental health education, awareness, and advocacy against social stigma. It aims to promote open discussions about mental disorders and investments in prevention and treatment services.",
    "funFact": "The first World Mental Health Day was celebrated in 1992, and each year has a different theme focusing on a specific aspect of mental wellbeing.",
    "media": "mental-health-day.jpg",
    "tags": ["health", "awareness", "education"]
  },
  {
    "date": "11-18",
    "name": "International Tongue Twister Day",
    "description": "A day dedicated to challenging your verbal skills with tongue twisters, those phrases designed to be difficult to articulate properly.",
    "funFact": "The English phrase 'sixth sick sheikh's sixth sheep's sick' is considered by many to be the toughest tongue twister in the English language.",
    "media": "tongue-twister-day.jpg",
    "tags": ["language", "fun", "education"]
  },
  {
    "date": "12-11",
    "name": "International Mountain Day",
    "description": "A day designated by the United Nations to highlight the importance of mountains to life, to draw attention to the opportunities and constraints in mountain development, and to build alliances for positive change for mountain peoples and environments.",
    "funFact": "Mountains cover around 22% of the Earth's land surface and are home to about 13% of the global population.",
    "media": "mountain-day.jpg",
    "tags": ["nature", "conservation", "environment"]
  }
]